user/tutorials/Nike/TemporalMixingLayer/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
    volScalarFieldValue T 311.0
    volVectorFieldValue U (0 0 0)
);

regions
(
    
    boxToCell
    {
	    box (0 0 0) (0.2 1 1);
        fieldValues
        (
            volScalarFieldValue p 80e+6 
        );
    }

);


// ************************************************************************* //
